gibix/ArduinoCore-zephyr/boards.txt
# Same upload path as the bare module - see the comment on nano_chandler above.
# The two boards share the variant, the partition table and one BFM image, so
# they also share the recovery VID/PID.
nano_chandler_monica.upload.tool=zephyr-smp
nano_chandler_monica.upload.tool.default=zephyr-smp
nano_chandler_monica.upload.protocol=
nano_chandler_monica.upload.transport=
nano_chandler_monica.upload.vid=0x2341
nano_chandler_monica.upload.pid=0x018e
# Same as nano_chandler above: CONFIG_BOOT_LINE_BUFS=16 but platform default
# of 8 is used to stay within CONFIG_BOOT_SERIAL_MAX_RECEIVE_SIZE (1024).
nano_chandler_monica.upload.use_1200bps_touch=true
nano_chandler_monica.upload.wait_for_upload_port=true
nano_chandler_monica.upload.native_usb=true

# burn-bootloader writes the LOADER into slot0 over SWD - the way back for a
# board whose PFM is empty or corrupt and which therefore cannot be reached over
# USB at all. It does not install MCUboot: that lives in BFM, whose write-protect
# bits re-arm at every reset and which the borrowed flash algorithm cannot
# program, so it stays tools/chandler_flasher/chandler_flasher.py's job.
#
# `pyocd load` does write PFM correctly - verified byte-for-byte 2026-08-18,
# against an earlier claim in this tree that it hangs. What it does need is the
# user script in pyocd.extra_flags above, which normalises SWAP.PFSWAP before
# the first flash access; without it, on a board whose BFM slot has been
# promoted, the image lands in the other panel and the read-back agrees with it.
nano_chandler_monica.bootloader.tool=pyocd
nano_chandler_monica.bootloader.tool.default=pyocd
nano_chandler_monica.bootloader.file=zephyr-{build.variant}.bin
nano_chandler_monica.bootloader.target={upload.target}
nano_chandler_monica.bootloader.address=0x0C000000
# The artifact is the MCUboot-headered image, a raw binary, so pyocd needs the
# address (see bootloader.load_at in platform.txt).
nano_chandler_monica.bootloader.load_at=@{bootloader.address}

